shs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2015-09-27 Sun 20:56 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Science technologie et société A</title>
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="css/hideshow.css"/>
<link rel="stylesheet" type="text/css" href="css/navbar.css"/>
<link rel="stylesheet" type="text/css" href="css/slider.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Science technologie et société A</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline3">1. Week 1</a>
<ul>
<li><a href="#orgheadline1">1.1. Software studies</a></li>
<li><a href="#orgheadline2">1.2. Contenu du cours</a></li>
</ul>
</li>
<li><a href="#orgheadline12">2. Week 2</a>
<ul>
<li><a href="#orgheadline4">2.1. Fait d'actualité : Wolkswagen triche sur ses test d'émissions de Diesel</a></li>
<li><a href="#orgheadline11">2.2. Histoire du logicielle :</a>
<ul>
<li><a href="#orgheadline5">2.2.1. Trois axes en Histoire</a></li>
<li><a href="#orgheadline10">2.2.2. Histoire sociotechnique (1945-1965)</a>
<ul>
<li><a href="#orgheadline6">2.2.2.1. WWII, ENIAC, EDVAC et BINAC</a></li>
<li><a href="#orgheadline7">2.2.2.2. 1943-1950 et le <i>Whirlind Project</i></a></li>
<li><a href="#orgheadline8">2.2.2.3. 1950-1963 et le projet SAGE</a></li>
<li><a href="#orgheadline9">2.2.2.4. Quelques enseignements : rôles des croyances :</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">1</span> Week 1</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>logiciels parties intégrantes de la société, font partie de la vie et de la culture. êtres logiciels.</li>
<li>Peu pris en compte dans la société. Effets sociaux ? Qui/quoi influence leur conception, fabrication, expansion, distribution ?</li>
</ul>
</div>

<div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> Software studies</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>être logiciel :
<ul class="org-ul">
<li>Complexité car multiplicité lors de la création, comportement innatendu, etc.</li>
</ul></li>
<li>Deux processus de gestation :
<ul class="org-ul">
<li>La façon dont les logiciels ont été façonnés</li>
<li>Dynamique d'expansion et d'usage</li>
</ul></li>
<li>Culture informatique
<ul class="org-ul">
<li>Plus loin que juste le code/la technicité, histoire de construction, d'industrie, de changements</li>
<li>Rapprocher les experts en info et les utilisateurs</li>
</ul></li>
<li>Nombreux enjeux politiques par rapport aux choix faits en informatique</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> Contenu du cours</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Histoires de formations logicielles</li>
<li>Economies et cultures logicielles</li>
<li>Pratique et consommation logicielles</li>
<li>Compostantes logicielles</li>
<li>Constructions et conceptions logicielles</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgheadline12" class="outline-2">
<h2 id="orgheadline12"><span class="section-number-2">2</span> Week 2</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">2.1</span> Fait d'actualité : Wolkswagen triche sur ses test d'émissions de Diesel</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>logiciel "espion" qui permettait de tricher
<ul class="org-ul">
<li>Fait la différence entre test réel et test en laboratoire</li>
</ul></li>
<li>Raisons possibles/mobile ?
<ul class="org-ul">
<li>Normes de l'EPA, difficiles à atteindre, plutôt faite pour moteurs américains</li>
</ul></li>
<li>Questions ?
<ul class="org-ul">
<li>Concurrents l'ont-ils découvert ? Font la même chose ?</li>
<li>Quantités d'immension de gaz testées en laboratoire, ceci remet en cause ces tests ?</li>
<li>Qu'en est-il d'aute logiciels placés dans d'autres objets ? Prolifération
potentielle de logiciels agissant à l'insu de l'utilisateur.
<ul class="org-ul">
<li>Question politique : Faut-il réguler ce genre de question ? Logiciel pas
considéré comme objet potentiellement dangereux, pas comme par exemples
les armes, les médicaments, l'agro-alimentaire.
<ul class="org-ul">
<li>(pour les 3 derniers) Mise en oeuvre pas étatique, mais plutôt privée,
voir même auto-régulation.</li>
</ul></li>
</ul></li>
</ul></li>
<li>L'usage du logiciel : entreprise utilise logiciel pour contourner législation</li>
<li>Conception/stratégie du logiciel</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">2.2</span> Histoire du logicielle :</h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-orgheadline5" class="outline-4">
<h4 id="orgheadline5"><span class="section-number-4">2.2.1</span> Trois axes en Histoire</h4>
<div class="outline-text-4" id="text-2-2-1">
<ul class="org-ul">
<li>Evolution des caractéristiques techniques des dispositifs</li>
<li>Biographie des personnages clé</li>
<li>Histoire intelectuelle des évolutions des porblèmes mathématique et d'ingénierie</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline10" class="outline-4">
<h4 id="orgheadline10"><span class="section-number-4">2.2.2</span> Histoire sociotechnique (1945-1965)</h4>
<div class="outline-text-4" id="text-2-2-2">
</div><div id="outline-container-orgheadline6" class="outline-5">
<h5 id="orgheadline6"><span class="section-number-5">2.2.2.1</span> WWII, ENIAC, EDVAC et BINAC</h5>
<div class="outline-text-5" id="text-2-2-2-1">
<ul class="org-ul">
<li>Dispositifs mécaniques de calcul : fort besoin de calculs pour ballistique,etc.</li>
<li>Demande en calcul de plus en plus importante.
<ul class="org-ul">
<li>Besoin d'autre chose que de l'analogique</li>
<li>En 1943 : projet <i>Colossus</i> pour décrypter le code allemand</li>
<li>Aux USA en 1943, projet ENIAC : but est d'accélérer les calculs balisitiques</li>
</ul></li>
<li>Projet ENIAC :
<ul class="org-ul">
<li>Opérationnel en 1946&#x2026;</li>
<li>"Enrôlé" pour résolution d'équation en physique nucléaire &rarr; ne marche pas bien&#x2026;</li>
</ul></li>
<li>EDVAC, sucesseur, basé sur le modèle de von Neumann : implémente le concept de "stored-program"</li>
<li>Personnages clés :
<ul class="org-ul">
<li>von Neumann</li>
<li>Eckert</li>
<li>Mauchly</li>
</ul></li>
<li>Trois éléments clés :
<ul class="org-ul">
<li>Entrée de la recherche en mathématiques appliquées dans les efforts de guerre</li>
<li>Nouvelle configuration géopolitique: Les USA comme superpuissance mondiale
et montée de l'URSS</li>
<li>Formation de nouveau collectifs de recherche qui perdureront une fois la
guerre terminée</li>
</ul></li>
<li>Concept d'orientation mutuelle</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-5">
<h5 id="orgheadline7"><span class="section-number-5">2.2.2.2</span> 1943-1950 et le <i>Whirlind Project</i></h5>
<div class="outline-text-5" id="text-2-2-2-2">
<ul class="org-ul">
<li>Les origines :
<ul class="org-ul">
<li>Fin 1941, entrée en guerre, besoin en termes d'aéronautique et de formation au pilotage.</li>
<li>L'armée américaine disposait déjà des simulateurs de vols, mais électromécanique</li>
<li><b>Problème</b> : pour chaque modèle d'avion, un modèle d'avion spécifique</li>
</ul></li>
<li>1943, un simulateur universel
<ul class="org-ul">
<li>Labo du MIT</li>
<li>Projet confié à Jay Forrester</li>
</ul></li>
<li>De l'analogique au numérique
<ul class="org-ul">
<li>A la base, projet de le faire avec des ordinateurs analogique</li>
<li>1945, Forrester entend parler de l'ordinateur numérique &rarr; pour lui
la solution au problème des opérations de calcul en temps réels, mais besoin
de demande de budget &rarr; demande acceptée.</li>
</ul></li>
<li>Deux problèmes :
<ul class="org-ul">
<li>Nouveau système de mémoire vive à instaurer, car mémoires actuelles trop lentes</li>
<li>Fin de la guerre, projet mis sous la tutelle d'un autre organisme qui lui
doute de plus en plus de la faisabilité du projet.</li>
</ul></li>
<li>De simulateur à système d'information
<ul class="org-ul">
<li>Pour justifier les couts, devient un système d'information militaire</li>
<li>Budget de plus en plus réduit, en 1949, quasi enterré.</li>
<li>Mais en 1949, on apprend que la Russie possède la bombe nucléaire.</li>
</ul></li>
<li><i>Whirlind</i> repris par la <i>Air force</i> et devient alors le projet SAGE</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-5">
<h5 id="orgheadline8"><span class="section-number-5">2.2.2.3</span> 1950-1963 et le projet SAGE</h5>
<div class="outline-text-5" id="text-2-2-2-3">
<ul class="org-ul">
<li>1951 Mémoire électro-statique trop peu performante et fiable &rarr; une partie du labo est dédiée à la recherche sur la mémoire.</li>
<li>1953 Remplacement de la mémoire par de la mémoire à tore magnétique &rarr; <i>Whirlind</i> devient l'ordinateur le plus puissant et le plus fiable</li>
<li>1954-1955 Transfert graduelle de la techno du projet à IBM</li>
<li>Estimation du coût total du projet depuis la reprise de la <i>Air Force</i> estimée entre 9-16 mia ?</li>
<li>23 IBM (basé sur le SAGE) aux USA</li>
<li>Bilan :
<ul class="org-ul">
<li>En tant que système de commandement, pas eu un rôle très important&#x2026;</li>
<li>Mais a grandement participé à <b>l'instauration d'une industrie de sous-traitants</b> actifs dans le domaine de l'information digitale, le traiment du signal, le <i>hardware</i> et surtout le <i>software</i></li>
</ul></li>
<li>IBM en sort fondamentalemnt grandie</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-5">
<h5 id="orgheadline9"><span class="section-number-5">2.2.2.4</span> Quelques enseignements : rôles des croyances :</h5>
<div class="outline-text-5" id="text-2-2-2-4">
<ol class="org-ol">
<li>Problématique militaire comme moteur d'innovations technologiques
<ul class="org-ul">
<li>Mise en place de nouvelles communautés de chercheurs</li>
<li>Croyance de l'utilité de l'informatique et des mathématiques pour des avancées militaire</li>
</ul></li>
<li>Instauration d'un modèle de recherche et de développpement qui se répètera dans les décennies suivantes
<ul class="org-ul">
<li>Triangulation et mise en place d'habitudes de travail entre organismes de financment liés à la défense de &#x2026;</li>
</ul></li>
<li>Dès ses débuts, la recherche en informatiquese déploie - malgré elle - en parallèle à cette équation: comment diffuser au mieux des injonctions ?
<ul class="org-ul">
<li>Les concepts de "signaux" et d'"informations" sont fondamentalement liés à des problématiques de gestion et d'encadrement</li>
</ul></li>
</ol>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2015-09-27 Sun 20:56</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
